ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
#include <Arduino.h>
#include <SoftwareSerial.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <LittleFS.h>

/*
============================================================
                TERRALINK RECEIVER #2
             RESCUE COMMAND CENTER
============================================================

ESP8266 NodeMCU

UART:
RX = D8
TX = D0

KEYPAD:

COL1 = D1
COL2 = D2
COL3 = D5
COL4 = D6

ROW1 = D7
ROW2 = GPIO3 / RX
ROW3 = D4
ROW4 = D3

WiFi AP:
SSID     = TerraLink-RX2
PASSWORD = terralink123

============================================================
*/

/* =========================================================
                         WIFI
========================================================= */

const char* AP_SSID =
  "TerraLink-RX2";

const char* AP_PASSWORD =
  "terralink123";

ESP8266WebServer server(80);

/* =========================================================
                         UART
========================================================= */

#define UART_RX_PIN D8
#define UART_TX_PIN D0

SoftwareSerial rescueSerial(
  UART_RX_PIN,
  UART_TX_PIN
);

#define UART_BAUD 9600

String uartBuffer = "";

/* =========================================================
                         KEYPAD
========================================================= */

#define COL1 D1
#define COL2 D2
#define COL3 D5
#define COL4 D6

#define ROW1 D7
#define ROW2 3
#define ROW3 D4
#define ROW4 D3

uint8_t rowPins[4] =
{
  ROW1,
  ROW2,
  ROW3,
  ROW4
};

uint8_t colPins[4] =
{
  COL1,
  COL2,
  COL3,
  COL4
};

char keyMap[4][4] =
{
  {'1','2','3','A'},
  {'4','5','6','B'},
  {'7','8','9','C'},
  {'*','0','#','D'}
};

/* =========================================================
                     DATABASE
========================================================= */

#define MAX_NODES 15

struct NodeRecord
{
  bool valid;

  uint16_t nodeId;

  uint32_t sequence;

  String latitude;
  String longitude;

  int hop;
  int rssi;

  bool sosActive;
  bool resolved;

  unsigned long firstSeen;
  unsigned long lastSeen;
};

NodeRecord nodes[MAX_NODES];

int selectedNodeIndex = -1;

/* =========================================================
                     INCIDENT
========================================================= */

struct IncidentRecord
{
  bool valid;

  String incidentId;

  uint16_t nodeId;

  uint32_t sequence;

  String latitude;
  String longitude;

  int hop;
  int rssi;

  String status;

  unsigned long createdAt;
  unsigned long updatedAt;
};

#define MAX_INCIDENTS 20

IncidentRecord incidents[MAX_INCIDENTS];

/* =========================================================
                    MESSAGE RECORD
========================================================= */

struct MessageRecord
{
  bool valid;

  uint16_t nodeId;

  uint32_t sequence;

  String message;

  String status;

  unsigned long timestamp;
};

#define MAX_MESSAGES 25

MessageRecord messages[MAX_MESSAGES];

/* =========================================================
                    RX1 STATUS
========================================================= */

bool rx1Online = false;

unsigned long rx1LastSeen = 0;

unsigned long rx1LoRaRx = 0;
unsigned long rx1LoRaTx = 0;

unsigned long rx1SOS = 0;
unsigned long rx1ACK = 0;
unsigned long rx1LOC = 0;
unsigned long rx1MSG = 0;

/* =========================================================
                     UI STATE
========================================================= */

enum UIState
{
  UI_HOME,
  UI_NODE_SELECT,
  UI_NODE_CONTROL,
  UI_ACTION_CONFIRM,
  UI_NODE_INFO,
  UI_RESOLVE_CONFIRM,
  UI_SENT_STATUS
};

UIState uiState = UI_HOME;

/* =========================================================
                     ACTION TYPE
========================================================= */

enum ActionType
{
  ACT_NONE,

  ACT_STAY_CALM,
  ACT_RESCUE,
  ACT_DO_NOT_MOVE,
  ACT_LOCATION_AGAIN,
  ACT_HELP_APPROACHING,
  ACT_GPS_REQUEST,
  ACT_EMERGENCY,
  ACT_RESOLVE
};

ActionType pendingAction = ACT_NONE;

/* =========================================================
                       WEB STATE
========================================================= */

String webMessage =
  "System Ready";

unsigned long webMessageTime = 0;

/* =========================================================
                      PROTOTYPES
========================================================= */

char scanKeypadRaw();
char getKeypadKey();
char translateKey(char key);
void handleKey(char key);

void showHomeScreen();
void showNodeSelectionScreen();
void showNodeControlScreen();
void showActionConfirmScreen();
void showNodeInfoScreen();
void showResolveConfirmScreen();
void showSentScreen();

String actionName(ActionType action);
String getUIStateName();

int findNode(uint16_t nodeId);
int allocateNodeSlot();

int getNodeCount();
int getActiveSOSCount();

bool isNodeValid(int index);

void updateNodeFromSOS(
  uint16_t nodeId,
  uint32_t sequence,
  String latitude,
  String longitude,
  int hop,
  int rssi
);

void processUART();
void processUARTLine(String line);

void processSOS(String line);
void processLOCATION(String line);
void processACK(String line);
void processMSGACK(String line);
void processRESOLVEACK(String line);
void processRX1Status(String line);
void processTXStatus(String line);

void sendCommandToRX1(
  String type,
  uint16_t nodeId,
  String payload
);

void executePendingAction();

void resolveSelectedNode();

void createIncident(
  uint16_t nodeId,
  uint32_t sequence,
  String lat,
  String lon,
  int hop,
  int rssi
);

void updateIncidentStatus(
  uint16_t nodeId,
  String status
);

void addMessageLog(
  uint16_t nodeId,
  uint32_t sequence,
  String message,
  String status
);

void updateMessageStatus(
  uint16_t nodeId,
  uint32_t sequence,
  String status
);

String createIncidentId(
  uint16_t nodeId,
  uint32_t seq
);

void initDatabase();

void saveNodes();
void saveIncidents();
void saveMessages();

void loadNodes();
void loadIncidents();
void loadMessages();

void clearDatabase();

String htmlEscape(String value);

void setupWebServer();

