ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
void handleRoot();
void handleAPIStatus();
void handleAPINodes();
void handleAPIIncidents();
void handleAPIMessages();

void handleWebCommand();
void handleWebResolve();
void handleWebClear();

String makeDashboardHTML();

/* =========================================================
                    DATABASE INIT
========================================================= */

void initDatabase()
{
  for (int i = 0; i < MAX_NODES; i++)
  {
    nodes[i].valid = false;
    nodes[i].nodeId = 0;
    nodes[i].sequence = 0;
    nodes[i].latitude = "";
    nodes[i].longitude = "";
    nodes[i].hop = 0;
    nodes[i].rssi = 0;
    nodes[i].sosActive = false;
    nodes[i].resolved = false;
    nodes[i].firstSeen = 0;
    nodes[i].lastSeen = 0;
  }

  for (int i = 0; i < MAX_INCIDENTS; i++)
  {
    incidents[i].valid = false;
  }

  for (int i = 0; i < MAX_MESSAGES; i++)
  {
    messages[i].valid = false;
  }
}

/* =========================================================
                    FIND NODE
========================================================= */

int findNode(
  uint16_t nodeId
)
{
  for (int i = 0; i < MAX_NODES; i++)
  {
    if (
      nodes[i].valid &&
      nodes[i].nodeId == nodeId
    )
    {
      return i;
    }
  }

  return -1;
}

/* =========================================================
                  ALLOCATE NODE
========================================================= */

int allocateNodeSlot()
{
  for (int i = 0; i < MAX_NODES; i++)
  {
    if (!nodes[i].valid)
      return i;
  }

  int oldest = 0;

  unsigned long oldestTime =
    nodes[0].lastSeen;

  for (int i = 1; i < MAX_NODES; i++)
  {
    if (
      nodes[i].lastSeen <
      oldestTime
    )
    {
      oldestTime =
        nodes[i].lastSeen;

      oldest = i;
    }
  }

  return oldest;
}

/* =========================================================
                    NODE COUNT
========================================================= */

int getNodeCount()
{
  int count = 0;

  for (int i = 0; i < MAX_NODES; i++)
  {
    if (nodes[i].valid)
      count++;
  }

  return count;
}

/* =========================================================
                  ACTIVE SOS COUNT
========================================================= */

int getActiveSOSCount()
{
  int count = 0;

  for (int i = 0; i < MAX_NODES; i++)
  {
    if (
      nodes[i].valid &&
      nodes[i].sosActive &&
      !nodes[i].resolved
    )
    {
      count++;
    }
  }

  return count;
}

/* =========================================================
                    NODE VALID
========================================================= */

bool isNodeValid(int index)
{
  if (
    index < 0 ||
    index >= MAX_NODES
  )
  {
    return false;
  }

  return nodes[index].valid;
}

/* =========================================================
                 CREATE INCIDENT ID
========================================================= */

String createIncidentId(
  uint16_t nodeId,
  uint32_t seq
)
{
  return
    "TL-" +
    String(nodeId) +
    "-" +
    String(seq);
}

/* =========================================================
                    UPDATE NODE
========================================================= */

void updateNodeFromSOS(
  uint16_t nodeId,
  uint32_t sequence,
  String latitude,
  String longitude,
  int hop,
  int rssi
)
{
  int index =
    findNode(nodeId);

  if (index < 0)
  {
    index =
      allocateNodeSlot();

    nodes[index].valid = true;

    nodes[index].firstSeen =
      millis();
  }

  nodes[index].nodeId =
    nodeId;

  nodes[index].sequence =
    sequence;

  nodes[index].latitude =
    latitude;

  nodes[index].longitude =
    longitude;

  nodes[index].hop =
    hop;

  nodes[index].rssi =
    rssi;

  nodes[index].sosActive =
    true;

  nodes[index].resolved =
    false;

  nodes[index].lastSeen =
    millis();

  selectedNodeIndex =
    index;

  createIncident(
    nodeId,
    sequence,
    latitude,
    longitude,
    hop,
    rssi
  );

  saveNodes();

  Serial.println();
  Serial.println("======================================");
  Serial.println("          NEW SOS INCIDENT");
  Serial.println("======================================");

  Serial.print("NODE: ");
  Serial.println(nodeId);

  Serial.print("SEQ: ");
  Serial.println(sequence);

  Serial.print("LAT: ");
  Serial.println(latitude);

  Serial.print("LON: ");
  Serial.println(longitude);

  Serial.print("HOP: ");
  Serial.println(hop);

  Serial.print("RSSI: ");
  Serial.println(rssi);

  Serial.println("======================================");

  uiState = UI_HOME;

  showHomeScreen();
}

/* =========================================================
                  CREATE INCIDENT
========================================================= */

void createIncident(
  uint16_t nodeId,
  uint32_t sequence,
  String lat,
  String lon,
  int hop,
  int rssi
)
{
  /*
     Check whether incident already exists.
  */

  for (int i = 0; i < MAX_INCIDENTS; i++)
  {
    if (
      incidents[i].valid &&
      incidents[i].nodeId == nodeId &&
      incidents[i].sequence == sequence
    )
    {
      incidents[i].latitude = lat;
      incidents[i].longitude = lon;
      incidents[i].hop = hop;
      incidents[i].rssi = rssi;
      incidents[i].updatedAt = millis();

      saveIncidents();

      return;
    }
  }

  int slot = -1;

  for (int i = 0; i < MAX_INCIDENTS; i++)
  {
    if (!incidents[i].valid)
    {
      slot = i;
      break;
    }
  }

  if (slot < 0)
  {
    slot = 0;

    for (int i = 1; i < MAX_INCIDENTS; i++)
    {
      if (
        incidents[i].createdAt <
        incidents[slot].createdAt
      )
      {
        slot = i;
      }
    }
  }

  incidents[slot].valid = true;

  incidents[slot].incidentId =
    createIncidentId(
      nodeId,
      sequence
    );

  incidents[slot].nodeId =
    nodeId;

  incidents[slot].sequence =
    sequence;

  incidents[slot].latitude =
    lat;

  incidents[slot].longitude =
    lon;

