ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
  incidents[slot].hop =
    hop;

  incidents[slot].rssi =
    rssi;

  incidents[slot].status =
    "ACTIVE";

  incidents[slot].createdAt =
    millis();

  incidents[slot].updatedAt =
    millis();

  saveIncidents();
}

/* =========================================================
                 UPDATE INCIDENT STATUS
========================================================= */

void updateIncidentStatus(
  uint16_t nodeId,
  String status
)
{
  for (int i = 0; i < MAX_INCIDENTS; i++)
  {
    if (
      incidents[i].valid &&
      incidents[i].nodeId == nodeId &&
      incidents[i].status != "RESOLVED"
    )
    {
      incidents[i].status =
        status;

      incidents[i].updatedAt =
        millis();
    }
  }

  saveIncidents();
}

/* =========================================================
                    MESSAGE LOG
========================================================= */

void addMessageLog(
  uint16_t nodeId,
  uint32_t sequence,
  String message,
  String status
)
{
  /*
     Shift oldest message when full.
  */

  int slot = -1;

  for (int i = 0; i < MAX_MESSAGES; i++)
  {
    if (!messages[i].valid)
    {
      slot = i;
      break;
    }
  }

  if (slot < 0)
  {
    for (int i = 1; i < MAX_MESSAGES; i++)
    {
      messages[i - 1] =
        messages[i];
    }

    slot =
      MAX_MESSAGES - 1;
  }

  messages[slot].valid = true;

  messages[slot].nodeId =
    nodeId;

  messages[slot].sequence =
    sequence;

  messages[slot].message =
    message;

  messages[slot].status =
    status;

  messages[slot].timestamp =
    millis();

  saveMessages();
}

/* =========================================================
                 UPDATE MESSAGE STATUS
========================================================= */

void updateMessageStatus(
  uint16_t nodeId,
  uint32_t sequence,
  String status
)
{
  for (int i = MAX_MESSAGES - 1; i >= 0; i--)
  {
    if (
      messages[i].valid &&
      messages[i].nodeId == nodeId &&
      messages[i].sequence == sequence
    )
    {
      messages[i].status =
        status;

      saveMessages();

      return;
    }
  }
}

/* =========================================================
                    PROCESS UART
========================================================= */

void processUART()
{
  while (rescueSerial.available())
  {
    char c =
      rescueSerial.read();

    if (c == '\r')
      continue;

    if (c == '\n')
    {
      uartBuffer.trim();

      if (uartBuffer.length() > 0)
      {
        processUARTLine(
          uartBuffer
        );
      }

      uartBuffer = "";

      continue;
    }

    uartBuffer += c;

    if (uartBuffer.length() > 250)
    {
      uartBuffer = "";

      Serial.println(
        "[ERROR] UART overflow"
      );
    }
  }
}

/* =========================================================
                 PROCESS UART LINE
========================================================= */

void processUARTLine(
  String line
)
{
  line.trim();

  Serial.print("[UART RX] ");
  Serial.println(line);

  if (line.startsWith("SOS,"))
  {
    processSOS(line);
    return;
  }

  if (line.startsWith("LOCATION,"))
  {
    processLOCATION(line);
    return;
  }

  if (line.startsWith("ACK,"))
  {
    processACK(line);
    return;
  }

  if (line.startsWith("MSG_ACK,"))
  {
    processMSGACK(line);
    return;
  }

  if (line.startsWith("RESOLVE_ACK,"))
  {
    processRESOLVEACK(line);
    return;
  }

  if (line.startsWith("RX1_STATUS,"))
  {
    processRX1Status(line);
    return;
  }

  if (line.startsWith("TX_STATUS,"))
  {
    processTXStatus(line);
    return;
  }

  if (line.startsWith("RX1,ONLINE"))
  {
    rx1Online = true;
    rx1LastSeen = millis();
    return;
  }

  Serial.println("[UART] Unknown packet");
}

/* =========================================================
                     PROCESS SOS
========================================================= */

void processSOS(
  String line
)
{
  /*
     Expected:

     SOS,node,seq,lat,lon,hop,rssi,ttl
  */

  int p1 = line.indexOf(',');
  int p2 = line.indexOf(',', p1 + 1);
  int p3 = line.indexOf(',', p2 + 1);
  int p4 = line.indexOf(',', p3 + 1);
  int p5 = line.indexOf(',', p4 + 1);
  int p6 = line.indexOf(',', p5 + 1);
  int p7 = line.indexOf(',', p6 + 1);

  if (
    p1 < 0 ||
    p2 < 0 ||
    p3 < 0 ||
    p4 < 0
  )
  {
    Serial.println("[ERROR] Invalid SOS");
    return;
  }

  String nodeString =
    line.substring(p1 + 1, p2);

  String seqString =
    line.substring(p2 + 1, p3);

  String lat =
    line.substring(p3 + 1, p4);

  String lon;

  int hop = 0;
  int rssi = 0;

  if (p5 >= 0)
  {
    lon =
      line.substring(p4 + 1, p5);
  }
  else
  {
    lon =
      line.substring(p4 + 1);
  }

  if (p6 >= 0)
  {
    hop =
      line.substring(p5 + 1, p6)
      .toInt();

    rssi =
      line.substring(p6 + 1,
                     p7 >= 0 ? p7 : line.length())
      .toInt();
  }

  uint16_t node =
    nodeString.toInt();

  uint32_t seq =
    strtoul(
      seqString.c_str(),
      NULL,
      10
    );

  updateNodeFromSOS(
    node,
    seq,
    lat,
    lon,
    hop,
    rssi
  );
}

/* =========================================================
                   PROCESS LOCATION
========================================================= */

void processLOCATION(
  String line
)
{
  /*
     LOCATION,node,seq,lat,lon,hop,rssi
  */

  int p1 = line.indexOf(',');
  int p2 = line.indexOf(',', p1 + 1);
  int p3 = line.indexOf(',', p2 + 1);
  int p4 = line.indexOf(',', p3 + 1);
  int p5 = line.indexOf(',', p4 + 1);
  int p6 = line.indexOf(',', p5 + 1);

  if (
    p4 < 0
  )
  {
    return;
  }

  uint16_t node =
    line.substring(
      p1 + 1,
      p2
    ).toInt();

  uint32_t seq =
    strtoul(
      line.substring(
        p2 + 1,
        p3
      ).c_str(),
      NULL,
      10
    );

  String lat =
    line.substring(
      p3 + 1,
      p4
    );

  String lon;

  int hop = 0;
  int rssi = 0;

  if (p5 >= 0)
  {
    lon =
      line.substring(
        p4 + 1,
        p5
      );
  }
  else
  {
    lon =
      line.substring(
        p4 + 1
      );
  }

