ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
  if (p6 >= 0)
  {
    hop =
      line.substring(
        p5 + 1,
        p6
      ).toInt();

    rssi =
      line.substring(
        p6 + 1
      ).toInt();
  }

  int index =
    findNode(node);

  if (index < 0)
  {
    index =
      allocateNodeSlot();

    nodes[index].valid =
      true;

    nodes[index].nodeId =
      node;

    nodes[index].firstSeen =
      millis();
  }

  nodes[index].sequence =
    seq;

  nodes[index].latitude =
    lat;

  nodes[index].longitude =
    lon;

  nodes[index].hop =
    hop;

  nodes[index].rssi =
    rssi;

  nodes[index].lastSeen =
    millis();

  saveNodes();

  Serial.println(
    "[OK] GPS location updated"
  );
}

/* =========================================================
                       PROCESS ACK
========================================================= */

void processACK(
  String line
)
{
  /*
     ACK,node,seq
  */

  int p1 =
    line.indexOf(',');

  int p2 =
    line.indexOf(
      ',',
      p1 + 1
    );

  if (p2 < 0)
    return;

  uint16_t node =
    line.substring(
      p1 + 1,
      p2
    ).toInt();

  uint32_t seq =
    strtoul(
      line.substring(
        p2 + 1
      ).c_str(),
      NULL,
      10
    );

  rx1ACK++;

  updateMessageStatus(
    node,
    seq,
    "ACKNOWLEDGED"
  );

  updateIncidentStatus(
    node,
    "ACKNOWLEDGED"
  );

  Serial.println(
    "[OK] ACK received"
  );
}

/* =========================================================
                   PROCESS MESSAGE ACK
========================================================= */

void processMSGACK(
  String line
)
{
  /*
     MSG_ACK,node,seq,status
  */

  int p1 = line.indexOf(',');
  int p2 = line.indexOf(',', p1 + 1);
  int p3 = line.indexOf(',', p2 + 1);

  if (p3 < 0)
    return;

  uint16_t node =
    line.substring(
      p1 + 1,
      p2
    ).toInt();

  uint32_t seq =
    strtoul(
      line.substring(
        p2 + 1,
        p3
      ).c_str(),
      NULL,
      10
    );

  String status =
    line.substring(
      p3 + 1
    );

  status.trim();

  updateMessageStatus(
    node,
    seq,
    status
  );

  Serial.println(
    "[OK] Message delivery status updated"
  );
}

/* =========================================================
                  PROCESS RESOLVE ACK
========================================================= */

void processRESOLVEACK(
  String line
)
{
  /*
     RESOLVE_ACK,node,seq
  */

  int p1 = line.indexOf(',');
  int p2 = line.indexOf(',', p1 + 1);

  if (p2 < 0)
    return;

  uint16_t node =
    line.substring(
      p1 + 1,
      p2
    ).toInt();

  updateIncidentStatus(
    node,
    "RESOLVED"
  );

  int index =
    findNode(node);

  if (index >= 0)
  {
    nodes[index].sosActive =
      false;

    nodes[index].resolved =
      true;

    saveNodes();
  }
}

/* =========================================================
                    RX1 STATUS
========================================================= */

void processRX1Status(
  String line
)
{
  /*
     RX1_STATUS,rx,tx,sos,ack,loc,msg
  */

  int p1 = line.indexOf(',');
  int p2 = line.indexOf(',', p1 + 1);
  int p3 = line.indexOf(',', p2 + 1);
  int p4 = line.indexOf(',', p3 + 1);
  int p5 = line.indexOf(',', p4 + 1);
  int p6 = line.indexOf(',', p5 + 1);

  if (p6 < 0)
    return;

  rx1LoRaRx =
    line.substring(
      p1 + 1,
      p2
    ).toInt();

  rx1LoRaTx =
    line.substring(
      p2 + 1,
      p3
    ).toInt();

  rx1SOS =
    line.substring(
      p3 + 1,
      p4
    ).toInt();

  rx1ACK =
    line.substring(
      p4 + 1,
      p5
    ).toInt();

  rx1LOC =
    line.substring(
      p5 + 1,
      p6
    ).toInt();

  rx1MSG =
    line.substring(
      p6 + 1
    ).toInt();

  rx1Online = true;

  rx1LastSeen =
    millis();
}

/* =========================================================
                    TX STATUS
========================================================= */

void processTXStatus(
  String line
)
{
  /*
     TX_STATUS,SENT,node,seq,message
  */

  int p1 = line.indexOf(',');
  int p2 = line.indexOf(',', p1 + 1);
  int p3 = line.indexOf(',', p2 + 1);
  int p4 = line.indexOf(',', p3 + 1);

  if (p3 < 0)
    return;

  String status =
    line.substring(
      p1 + 1,
      p2
    );

  uint16_t node =
    line.substring(
      p2 + 1,
      p3
    ).toInt();

  uint32_t seq = 0;

  String message = "";

  if (p4 >= 0)
  {
    seq =
      strtoul(
        line.substring(
          p3 + 1,
          p4
        ).c_str(),
        NULL,
        10
      );

    message =
      line.substring(
        p4 + 1
      );
  }
  else
  {
    seq =
      strtoul(
        line.substring(
          p3 + 1
        ).c_str(),
        NULL,
        10
      );
  }

  addMessageLog(
    node,
    seq,
    message,
    status
  );
}

/* =========================================================
                 SEND COMMAND TO RX1
========================================================= */

void sendCommandToRX1(
  String type,
  uint16_t nodeId,
  String payload
)
{
  payload.replace("\r", " ");
  payload.replace("\n", " ");
  payload.replace(",", " ");

  String command =
    "TL," +
    type +
    "," +
    String(nodeId);

  if (payload.length() > 0)
  {
    command += ",";
    command += payload;
  }

  rescueSerial.println(
    command
  );

  rescueSerial.flush();

  Serial.print(
    "[UART TX -> RX1] "
  );

  Serial.println(
    command
  );

  webMessage =
    "Command sent";

  webMessageTime =
    millis();
}

/* =========================================================
                  EXECUTE ACTION
========================================================= */

void executePendingAction()
{
  if (
    selectedNodeIndex < 0 ||
    !isNodeValid(selectedNodeIndex)
  )
  {
    uiState = UI_HOME;
    return;
  }

  uint16_t node =
    nodes[selectedNodeIndex].nodeId;

  String type;
  String payload;

  switch (pendingAction)
  {
    case ACT_STAY_CALM:
      type = "MSG";
      payload = "STAY CALM";
      break;

