ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
    case ACT_RESCUE:
      type = "MSG";
      payload =
        "RESCUE TEAM IS ON THE WAY";
      break;

    case ACT_DO_NOT_MOVE:
      type = "MSG";
      payload =
        "DO NOT MOVE";
      break;

    case ACT_LOCATION_AGAIN:
      type = "LOC_AGAIN";
      break;

    case ACT_HELP_APPROACHING:
      type = "MSG";
      payload =
        "HELP IS APPROACHING";
      break;

    case ACT_GPS_REQUEST:
      type = "GPS_REQUEST";
      break;

    case ACT_EMERGENCY:
      type = "EMERGENCY";
      break;

    default:
      return;
  }

  unsigned long seq =
    nodes[selectedNodeIndex].sequence;

  if (seq == 0)
    seq = millis();

  sendCommandToRX1(
    type,
    node,
    payload
  );

  if (type == "MSG" ||
      type == "EMERGENCY")
  {
    addMessageLog(
      node,
      seq,
      payload.length() > 0
        ? payload
        : "EMERGENCY PRIORITY",
      "QUEUED"
    );
  }

  uiState =
    UI_SENT_STATUS;

  showSentScreen();
}

/* =========================================================
                    RESOLVE NODE
========================================================= */

void resolveSelectedNode()
{
  if (
    selectedNodeIndex < 0 ||
    !isNodeValid(selectedNodeIndex)
  )
  {
    uiState = UI_HOME;
    return;
  }

  uint16_t node =
    nodes[selectedNodeIndex].nodeId;

  uint32_t seq =
    nodes[selectedNodeIndex].sequence;

  sendCommandToRX1(
    "RESOLVE",
    node,
    ""
  );

  nodes[selectedNodeIndex].sosActive =
    false;

  nodes[selectedNodeIndex].resolved =
    true;

  updateIncidentStatus(
    node,
    "RESOLVED"
  );

  saveNodes();

  uiState =
    UI_HOME;

  showHomeScreen();
}

/* =========================================================
                     CLEAR DATABASE
========================================================= */

void clearDatabase()
{
  initDatabase();

  LittleFS.remove("/nodes.db");
  LittleFS.remove("/incidents.db");
  LittleFS.remove("/messages.db");

  selectedNodeIndex = -1;

  Serial.println(
    "[DATABASE] Cleared"
  );
}

/* =========================================================
                       KEYPAD SCAN
========================================================= */

char scanKeypadRaw()
{
  for (int r = 0; r < 4; r++)
  {
    digitalWrite(
      rowPins[r],
      HIGH
    );
  }

  for (int r = 0; r < 4; r++)
  {
    digitalWrite(
      rowPins[r],
      LOW
    );

    delayMicroseconds(100);

    for (int c = 0; c < 4; c++)
    {
      if (
        digitalRead(
          colPins[c]
        ) == LOW
      )
      {
        digitalWrite(
          rowPins[r],
          HIGH
        );

        return keyMap[r][c];
      }
    }

    digitalWrite(
      rowPins[r],
      HIGH
    );
  }

  return 0;
}

/* =========================================================
                   KEYPAD DEBOUNCE
========================================================= */

char getKeypadKey()
{
  static char lastRaw = 0;
  static char stable = 0;

  static unsigned long changeTime = 0;

  char raw =
    scanKeypadRaw();

  if (raw != lastRaw)
  {
    lastRaw = raw;
    changeTime = millis();
  }

  if (
    millis() - changeTime >= 40
  )
  {
    if (raw != stable)
    {
      stable = raw;

      if (stable != 0)
      {
        return translateKey(stable);
      }
    }
  }

  return 0;
}

/* =========================================================
                    TRANSLATE KEYS
========================================================= */

char translateKey(char key)
{
  if (key == '*')
    return 'F';

  if (key == '#')
    return 'E';

  return key;
}

/* =========================================================
                    HANDLE KEY
========================================================= */

void handleKey(char key)
{
  if (key == '0')
  {
    uiState = UI_HOME;
    pendingAction = ACT_NONE;

    showHomeScreen();
    return;
  }

  if (uiState == UI_HOME)
  {
    if (key == '1')
    {
      if (getNodeCount() > 0)
      {
        if (
          selectedNodeIndex < 0 ||
          !isNodeValid(selectedNodeIndex)
        )
        {
          selectedNodeIndex = 0;
        }

        uiState =
          UI_NODE_SELECT;

        showNodeSelectionScreen();
      }

      return;
    }

    if (key == 'E')
    {
      if (
        selectedNodeIndex >= 0 &&
        isNodeValid(selectedNodeIndex)
      )
      {
        uiState =
          UI_NODE_INFO;

        showNodeInfoScreen();
      }

      return;
    }
  }

  if (uiState == UI_NODE_SELECT)
  {
    if (key == '2')
    {
      int start =
        selectedNodeIndex;

      do
      {
        selectedNodeIndex++;

        if (
          selectedNodeIndex >= MAX_NODES
        )
        {
          selectedNodeIndex = 0;
        }

      } while (
        !isNodeValid(selectedNodeIndex) &&
        selectedNodeIndex != start
      );

      showNodeSelectionScreen();
      return;
    }

    if (key == '3')
    {
      int start =
        selectedNodeIndex;

      do
      {
        selectedNodeIndex--;

        if (selectedNodeIndex < 0)
        {
          selectedNodeIndex =
            MAX_NODES - 1;
        }

      } while (
        !isNodeValid(selectedNodeIndex) &&
        selectedNodeIndex != start
      );

      showNodeSelectionScreen();
      return;
    }

    if (key == 'A')
    {
      uiState =
        UI_NODE_CONTROL;

      showNodeControlScreen();
      return;
    }

    if (key == 'B' ||
        key == 'C')
    {
      uiState = UI_HOME;
      showHomeScreen();
      return;
    }
  }

  if (uiState == UI_NODE_CONTROL)
  {
    switch (key)
    {
      case '4':
        pendingAction =
          ACT_STAY_CALM;
        break;

      case '5':
        pendingAction =
          ACT_RESCUE;
        break;

      case '6':
        pendingAction =
          ACT_DO_NOT_MOVE;
        break;

      case '7':
        pendingAction =
          ACT_LOCATION_AGAIN;
        break;

      case '8':
        pendingAction =
          ACT_HELP_APPROACHING;
        break;

      case '9':
        pendingAction =
          ACT_GPS_REQUEST;
        break;

      case 'F':
        pendingAction =
          ACT_EMERGENCY;
        break;

      case 'D':
        uiState =
          UI_RESOLVE_CONFIRM;

        showResolveConfirmScreen();
        return;

      case 'E':
        uiState =
          UI_NODE_INFO;

        showNodeInfoScreen();
        return;

      case 'B':
        uiState =
          UI_NODE_SELECT;

        showNodeSelectionScreen();
        return;

      default:
        return;
    }

    uiState =
      UI_ACTION_CONFIRM;

    showActionConfirmScreen();

    return;
  }

  if (uiState == UI_ACTION_CONFIRM)
  {
    if (key == 'A')
    {
      executePendingAction();
      return;
    }

    if (
      key == 'B' ||
      key == 'C'
    )
    {
      uiState =
        UI_NODE_CONTROL;

      showNodeControlScreen();

      return;
    }
  }

  if (uiState == UI_RESOLVE_CONFIRM)
  {
    if (key == 'A')
    {
      resolveSelectedNode();
      return;
    }

    if (
      key == 'B' ||
      key == 'C'
    )
    {
      uiState =
        UI_NODE_CONTROL;

      showNodeControlScreen();
      return;
    }
  }

  if (uiState == UI_NODE_INFO)
  {
    if (
      key == 'B' ||
      key == 'C'
    )
    {
      uiState =
        UI_NODE_CONTROL;

      showNodeControlScreen();
    }
  }

  if (uiState == UI_SENT_STATUS)
  {
    if (
      key == 'A' ||
      key == 'B' ||
      key == 'C'
    )
    {
      uiState =
        UI_NODE_CONTROL;

      showNodeControlScreen();
    }
  }
}

/* =========================================================
                     SERIAL UI
========================================================= */

void showHomeScreen()
{
  Serial.println();
  Serial.println(
    "========================================"
  );
  Serial.println(
    "       TERRALINK RESCUE COMMAND"
  );
  Serial.println(
    "========================================"
  );

  Serial.print(
    "ACTIVE SOS : "
  );

  Serial.println(
    getActiveSOSCount()
  );

  Serial.print(
    "NODES      : "
  );

  Serial.println(
    getNodeCount()
  );

  Serial.print(
    "RX1        : "
  );

  Serial.println(
    rx1Online
      ? "ONLINE"
      : "OFFLINE"
  );

  Serial.println();

  Serial.println(
    "1 = SELECT NODE"
  );

  Serial.println(
    "E = NODE INFO"
  );
}

/* =========================================================
                NODE SELECTION SCREEN
========================================================= */

void showNodeSelectionScreen()
{
  Serial.println();
  Serial.println(
    "----------- SELECT NODE -----------"
  );

  if (
    selectedNodeIndex < 0 ||
    !isNodeValid(selectedNodeIndex)
  )
  {
    Serial.println("NO NODE");
    return;
  }

  NodeRecord &n =
    nodes[selectedNodeIndex];

  Serial.print(
    "NODE: "
  );

  Serial.println(
    n.nodeId
  );

  Serial.print(
    "STATUS: "
  );

  Serial.println(
    n.sosActive &&
    !n.resolved
      ? "SOS ACTIVE"
      : "NORMAL"
  );

  Serial.println(
    "2 NEXT"
  );

  Serial.println(
    "3 PREVIOUS"
  );

  Serial.println(
    "A SELECT"
  );

  Serial.println(
    "B BACK"
  );
}

/* =========================================================
                   NODE CONTROL
========================================================= */

