ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
void showNodeControlScreen()
{
  Serial.println();
  Serial.println(
    "----------- NODE CONTROL -----------"
  );

  if (
    selectedNodeIndex < 0 ||
    !isNodeValid(selectedNodeIndex)
  )
  {
    return;
  }

  Serial.print(
    "NODE: "
  );

  Serial.println(
    nodes[selectedNodeIndex].nodeId
  );

  Serial.println(
    "4 STAY CALM"
  );

  Serial.println(
    "5 RESCUE ON WAY"
  );

  Serial.println(
    "6 DO NOT MOVE"
  );

  Serial.println(
    "7 LOCATION AGAIN"
  );

  Serial.println(
    "8 HELP APPROACHING"
  );

  Serial.println(
    "9 GPS REQUEST"
  );

  Serial.println(
    "F EMERGENCY"
  );

  Serial.println(
    "E NODE INFO"
  );

  Serial.println(
    "D RESOLVE"
  );
}

/* =========================================================
                   ACTION CONFIRM
========================================================= */

void showActionConfirmScreen()
{
  Serial.println();

  Serial.print(
    "ACTION: "
  );

  Serial.println(
    actionName(
      pendingAction
    )
  );

  Serial.println(
    "A = SEND"
  );

  Serial.println(
    "B/C = CANCEL"
  );
}

/* =========================================================
                    NODE INFO
========================================================= */

void showNodeInfoScreen()
{
  if (
    selectedNodeIndex < 0 ||
    !isNodeValid(selectedNodeIndex)
  )
  {
    return;
  }

  NodeRecord &n =
    nodes[selectedNodeIndex];

  Serial.println();

  Serial.println(
    "----------- NODE INFORMATION -----------"
  );

  Serial.print("NODE: ");
  Serial.println(n.nodeId);

  Serial.print("SEQ: ");
  Serial.println(n.sequence);

  Serial.print("LAT: ");
  Serial.println(n.latitude);

  Serial.print("LON: ");
  Serial.println(n.longitude);

  Serial.print("RSSI: ");
  Serial.println(n.rssi);

  Serial.print("HOPS: ");
  Serial.println(n.hop);

  Serial.print("SOS: ");

  Serial.println(
    n.sosActive
      ? "ACTIVE"
      : "NO"
  );

  Serial.print("RESOLVED: ");

  Serial.println(
    n.resolved
      ? "YES"
      : "NO"
  );

  Serial.println(
    "B = BACK"
  );
}

/* =========================================================
                 RESOLVE CONFIRM
========================================================= */

void showResolveConfirmScreen()
{
  Serial.println();
  Serial.println(
    "RESOLVE THIS INCIDENT?"
  );

  Serial.println(
    "A = YES"
  );

  Serial.println(
    "B/C = CANCEL"
  );
}

/* =========================================================
                    SENT SCREEN
========================================================= */

void showSentScreen()
{
  Serial.println();
  Serial.println(
    "----------- COMMAND SENT -----------"
  );

  Serial.println(
    actionName(
      pendingAction
    )
  );

  Serial.println(
    "A/B/C = CONTINUE"
  );
}

/* =========================================================
                    ACTION NAME
========================================================= */

String actionName(
  ActionType action
)
{
  switch (action)
  {
    case ACT_STAY_CALM:
      return "STAY CALM";

    case ACT_RESCUE:
      return "RESCUE TEAM IS ON THE WAY";

    case ACT_DO_NOT_MOVE:
      return "DO NOT MOVE";

    case ACT_LOCATION_AGAIN:
      return "LOCATION AGAIN";

    case ACT_HELP_APPROACHING:
      return "HELP APPROACHING";

    case ACT_GPS_REQUEST:
      return "GPS REQUEST";

    case ACT_EMERGENCY:
      return "EMERGENCY PRIORITY";

    case ACT_RESOLVE:
      return "RESOLVE";

    default:
      return "NONE";
  }
}

/* =========================================================
                    UI STATE NAME
========================================================= */

String getUIStateName()
{
  switch (uiState)
  {
    case UI_HOME:
      return "HOME";

    case UI_NODE_SELECT:
      return "NODE_SELECT";

    case UI_NODE_CONTROL:
      return "NODE_CONTROL";

    case UI_ACTION_CONFIRM:
      return "ACTION_CONFIRM";

    case UI_NODE_INFO:
      return "NODE_INFO";

    case UI_RESOLVE_CONFIRM:
      return "RESOLVE_CONFIRM";

    case UI_SENT_STATUS:
      return "SENT";

    default:
      return "UNKNOWN";
  }
}

/* =========================================================
                     HTML ESCAPE
========================================================= */

String htmlEscape(
  String value
)
{
  value.replace(
    "&",
    "&amp;"
  );

  value.replace(
    "<",
    "&lt;"
  );

  value.replace(
    ">",
    "&gt;"
  );

  value.replace(
    "\"",
    "&quot;"
  );

  return value;
}

/* =========================================================
                    WEB SERVER SETUP
========================================================= */

void setupWebServer()
{
  server.on(
    "/",
    HTTP_GET,
    handleRoot
  );

  server.on(
    "/api/status",
    HTTP_GET,
    handleAPIStatus
  );

  server.on(
    "/api/nodes",
    HTTP_GET,
    handleAPINodes
  );

  server.on(
    "/api/incidents",
    HTTP_GET,
    handleAPIIncidents
  );

  server.on(
    "/api/messages",
    HTTP_GET,
    handleAPIMessages
  );

  server.on(
    "/cmd",
    HTTP_GET,
    handleWebCommand
  );

  server.on(
    "/resolve",
    HTTP_GET,
    handleWebResolve
  );

  server.on(
    "/clear",
    HTTP_GET,
    handleWebClear
  );
}

/* =========================================================
                    WEB ROOT
========================================================= */

void handleRoot()
{
  server.send(
    200,
    "text/html",
    makeDashboardHTML()
  );
}

/* =========================================================
                    STATUS API
========================================================= */

void handleAPIStatus()
{
  String json;

  json += "{";

  json += "\"receiver\":2,";

  json += "\"rx1_online\":";
  json += rx1Online
    ? "true,"
    : "false,";

  json += "\"nodes\":";
  json += String(
    getNodeCount()
  );
  json += ",";

  json += "\"active_sos\":";
  json += String(
    getActiveSOSCount()
  );
  json += ",";

  json += "\"rx\":";
  json += String(
    rx1LoRaRx
  );
  json += ",";

