ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
  json += "\"tx\":";
  json += String(
    rx1LoRaTx
  );
  json += ",";

  json += "\"sos_packets\":";
  json += String(
    rx1SOS
  );
  json += ",";

  json += "\"ack_packets\":";
  json += String(
    rx1ACK
  );
  json += ",";

  json += "\"loc_packets\":";
  json += String(
    rx1LOC
  );
  json += ",";

  json += "\"msg_packets\":";
  json += String(
    rx1MSG
  );

  json += "}";

  server.send(
    200,
    "application/json",
    json
  );
}

/* =========================================================
                       NODES API
========================================================= */

void handleAPINodes()
{
  String json = "[";

  bool first = true;

  for (int i = 0; i < MAX_NODES; i++)
  {
    if (!nodes[i].valid)
      continue;

    if (!first)
      json += ",";

    first = false;

    json += "{";

    json += "\"id\":";
    json += String(
      nodes[i].nodeId
    );
    json += ",";

    json += "\"seq\":";
    json += String(
      nodes[i].sequence
    );
    json += ",";

    json += "\"lat\":\"";
    json += htmlEscape(
      nodes[i].latitude
    );
    json += "\",";

    json += "\"lon\":\"";
    json += htmlEscape(
      nodes[i].longitude
    );
    json += "\",";

    json += "\"hop\":";
    json += String(
      nodes[i].hop
    );
    json += ",";

    json += "\"rssi\":";
    json += String(
      nodes[i].rssi
    );
    json += ",";

    json += "\"sos\":";
    json += nodes[i].sosActive
      ? "true,"
      : "false,";

    json += "\"resolved\":";
    json += nodes[i].resolved
      ? "true"
      : "false";

    json += "}";
  }

  json += "]";

  server.send(
    200,
    "application/json",
    json
  );
}

/* =========================================================
                    INCIDENTS API
========================================================= */

void handleAPIIncidents()
{
  String json = "[";

  bool first = true;

  for (int i = 0; i < MAX_INCIDENTS; i++)
  {
    if (!incidents[i].valid)
      continue;

    if (!first)
      json += ",";

    first = false;

    json += "{";

    json += "\"id\":\"";
    json += incidents[i].incidentId;
    json += "\",";

    json += "\"node\":";
    json += String(
      incidents[i].nodeId
    );
    json += ",";

    json += "\"seq\":";
    json += String(
      incidents[i].sequence
    );
    json += ",";

    json += "\"lat\":\"";
    json += incidents[i].latitude;
    json += "\",";

    json += "\"lon\":\"";
    json += incidents[i].longitude;
    json += "\",";

    json += "\"hop\":";
    json += String(
      incidents[i].hop
    );
    json += ",";

    json += "\"rssi\":";
    json += String(
      incidents[i].rssi
    );
    json += ",";

    json += "\"status\":\"";
    json += incidents[i].status;
    json += "\"";

    json += "}";
  }

  json += "]";

  server.send(
    200,
    "application/json",
    json
  );
}

/* =========================================================
                    MESSAGES API
========================================================= */

void handleAPIMessages()
{
  String json = "[";

  bool first = true;

  for (int i = 0; i < MAX_MESSAGES; i++)
  {
    if (!messages[i].valid)
      continue;

    if (!first)
      json += ",";

    first = false;

    json += "{";

    json += "\"node\":";
    json += String(
      messages[i].nodeId
    );
    json += ",";

    json += "\"seq\":";
    json += String(
      messages[i].sequence
    );
    json += ",";

    json += "\"message\":\"";
    json += htmlEscape(
      messages[i].message
    );
    json += "\",";

    json += "\"status\":\"";
    json += messages[i].status;
    json += "\"";

    json += "}";
  }

  json += "]";

  server.send(
    200,
    "application/json",
    json
  );
}

/* =========================================================
                   WEB COMMAND
========================================================= */

void handleWebCommand()
{
  if (
    !server.hasArg("type") ||
    !server.hasArg("node")
  )
  {
    server.send(
      400,
      "text/plain",
      "Missing type/node"
    );

    return;
  }

  String type =
    server.arg("type");

  uint16_t node =
    server.arg("node").toInt();

  String payload = "";

  if (server.hasArg("msg"))
  {
    payload =
      server.arg("msg");
  }

  sendCommandToRX1(
    type,
    node,
    payload
  );

  uint32_t seq = millis();

  if (
    type == "MSG" ||
    type == "EMERGENCY"
  )
  {
    String stored =
      payload;

    if (
      type == "EMERGENCY" &&
      stored.length() == 0
    )
    {
      stored =
        "EMERGENCY PRIORITY";
    }

    addMessageLog(
      node,
      seq,
      stored,
      "QUEUED"
    );
  }

  server.send(
    200,
    "application/json",
    "{\"ok\":true}"
  );
}

/* =========================================================
                   WEB RESOLVE
========================================================= */

void handleWebResolve()
{
  if (!server.hasArg("node"))
  {
    server.send(
      400,
      "text/plain",
      "Missing node"
    );

    return;
  }

  uint16_t node =
    server.arg("node").toInt();

  sendCommandToRX1(
    "RESOLVE",
    node,
    ""
  );

  int index =
    findNode(node);

  if (index >= 0)
  {
    nodes[index].sosActive =
      false;

    nodes[index].resolved =
      true;
  }

  updateIncidentStatus(
    node,
    "RESOLVED"
  );

  saveNodes();

  server.send(
    200,
    "application/json",
    "{\"ok\":true}"
  );
}

/* =========================================================
                     WEB CLEAR
========================================================= */

void handleWebClear()
{
  clearDatabase();

  server.send(
    200,
    "application/json",
    "{\"ok\":true}"
  );
}

/* =========================================================
                 DASHBOARD HTML
========================================================= */

String makeDashboardHTML()
{
  String html;

  html.reserve(15000);

  html += F(
    "<!DOCTYPE html>"
    "<html>"
    "<head>"
    "<meta name='viewport' content='width=device-width,initial-scale=1'>"
    "<title>TerraLink Rescue Command Center</title>"
    "<style>"

