ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
    "body{"
    "font-family:Arial,sans-serif;"
    "margin:0;"
    "background:#10151c;"
    "color:#eee;"
    "}"

    ".header{"
    "padding:20px;"
    "background:#171e27;"
    "border-bottom:1px solid #333;"
    "}"

    ".title{"
    "font-size:26px;"
    "font-weight:bold;"
    "}"

    ".sub{"
    "opacity:.7;"
    "margin-top:5px;"
    "}"

    ".grid{"
    "display:grid;"
    "grid-template-columns:repeat(auto-fit,minmax(180px,1fr));"
    "gap:12px;"
    "padding:15px;"
    "}"

    ".card{"
    "background:#181f28;"
    "border:1px solid #303944;"
    "border-radius:12px;"
    "padding:15px;"
    "}"

    ".number{"
    "font-size:30px;"
    "font-weight:bold;"
    "margin-top:8px;"
    "}"

    ".danger{"
    "border:2px solid #d33;"
    "}"

    ".section{"
    "margin:15px;"
    "padding:18px;"
    "background:#181f28;"
    "border-radius:12px;"
    "border:1px solid #303944;"
    "}"

    "button{"
    "padding:10px 14px;"
    "margin:4px;"
    "border:0;"
    "border-radius:7px;"
    "cursor:pointer;"
    "}"

    "input,select,textarea{"
    "width:100%;"
    "box-sizing:border-box;"
    "padding:10px;"
    "margin:5px 0;"
    "background:#0e1319;"
    "color:#fff;"
    "border:1px solid #39434f;"
    "border-radius:6px;"
    "}"

    "textarea{"
    "height:90px;"
    "}"

    "table{"
    "width:100%;"
    "border-collapse:collapse;"
    "}"

    "th,td{"
    "padding:9px;"
    "border-bottom:1px solid #303944;"
    "text-align:left;"
    "}"

    ".active{"
    "font-weight:bold;"
    "}"

    ".online{"
    "font-weight:bold;"
    "}"

    ".mapbox{"
    "min-height:220px;"
    "background:#0e1319;"
    "border-radius:10px;"
    "padding:20px;"
    "}"

    ".route{"
    "font-family:monospace;"
    "font-size:16px;"
    "padding:10px;"
    "}"

    "</style>"
    "</head>"

    "<body>"

    "<div class='header'>"
    "<div class='title'>"
    "TERRALINK RESCUE COMMAND CENTER"
    "</div>"
    "<div class='sub'>"
    "Offline Emergency Communication Gateway"
    "</div>"
    "</div>"

    "<div class='grid'>"

    "<div class='card'>"
    "<div>ACTIVE SOS</div>"
    "<div id='sos' class='number'>0</div>"
    "</div>"

    "<div class='card'>"
    "<div>KNOWN NODES</div>"
    "<div id='nodes' class='number'>0</div>"
    "</div>"

    "<div class='card'>"
    "<div>RX1 GATEWAY</div>"
    "<div id='rx1' class='number'>OFFLINE</div>"
    "</div>"

    "<div class='card'>"
    "<div>LoRa RX</div>"
    "<div id='rx' class='number'>0</div>"
    "</div>"

    "<div class='card'>"
    "<div>LoRa TX</div>"
    "<div id='tx' class='number'>0</div>"
    "</div>"

    "<div class='card'>"
    "<div>SOS PACKETS</div>"
    "<div id='sosp' class='number'>0</div>"
    "</div>"

    "</div>"

    "<div class='section'>"
    "<h2>🚨 Active Incidents</h2>"
    "<div id='incidents'>Loading...</div>"
    "</div>"

    "<div class='section'>"
    "<h2>📍 Live Node Information</h2>"
    "<div id='nodeTable'>Loading...</div>"
    "</div>"

    "<div class='section'>"
    "<h2>📡 Mesh Route</h2>"
    "<div class='mapbox'>"
    "<div class='route'>"
    "VICTIM → RELAY → RELAY → RX1 → RX2"
    "</div>"
    "<p>"
    "Hop count and RSSI are taken from the received LoRa packet."
    "</p>"
    "</div>"
    "</div>"

    "<div class='section'>"
    "<h2>💬 Rescue Communication</h2>"

    "<label>Target Node</label>"
    "<input id='target' type='number' placeholder='Node ID'>"

    "<label>Quick Message</label>"

    "<button onclick=\"sendMsg('STAY CALM')\">"
    "STAY CALM"
    "</button>"

    "<button onclick=\"sendMsg('RESCUE TEAM IS ON THE WAY')\">"
    "RESCUE ON WAY"
    "</button>"

    "<button onclick=\"sendMsg('DO NOT MOVE')\">"
    "DO NOT MOVE"
    "</button>"

    "<button onclick=\"sendMsg('HELP IS APPROACHING')\">"
    "HELP APPROACHING"
    "</button>"

    "<button onclick=\"sendType('GPS_REQUEST')\">"
    "REQUEST GPS"
    "</button>"

    "<button onclick=\"sendType('LOC_AGAIN')\">"
    "LOCATION AGAIN"
    "</button>"

    "<button onclick=\"sendType('EMERGENCY')\">"
    "🚨 EMERGENCY"
    "</button>"

    "<h3>Custom Message</h3>"

    "<textarea id='custom' "
    "placeholder='Type message to victim...'></textarea>"

    "<button onclick='sendCustom()'>"
    "SEND CUSTOM MESSAGE"
    "</button>"

    "</div>"

    "<div class='section'>"
    "<h2>📨 Communication Log</h2>"
    "<div id='messages'>Loading...</div>"
    "</div>"

    "<div class='section'>"
    "<h2>⚙ System</h2>"

    "<p>"
    "Wi-Fi AP: TerraLink-RX2"
    "</p>"

    "<p>"
    "IP: 192.168.4.1"
    "</p>"

    "<button onclick='location.reload()'>"
    "REFRESH"
    "</button>"

    "<button onclick=\"clearDB()\">"
    "CLEAR DATABASE"
    "</button>"

    "</div>"

    "<script>"

    "function sendType(type){"
    "let n=document.getElementById('target').value;"
    "if(!n){alert('Enter target node');return;}"
    "fetch('/cmd?type='+encodeURIComponent(type)+'&node='+encodeURIComponent(n))"
    ".then(()=>alert('Command sent'));"
    "}"

    "function sendMsg(msg){"
    "let n=document.getElementById('target').value;"
    "if(!n){alert('Enter target node');return;}"
    "fetch('/cmd?type=MSG&node='+encodeURIComponent(n)+'&msg='+encodeURIComponent(msg))"
    ".then(()=>alert('Message queued'));"
    "}"

    "function sendCustom(){"
    "let n=document.getElementById('target').value;"
    "let m=document.getElementById('custom').value;"
    "if(!n||!m){alert('Enter node and message');return;}"
    "fetch('/cmd?type=MSG&node='+encodeURIComponent(n)+'&msg='+encodeURIComponent(m))"
    ".then(()=>alert('Custom message queued'));"
    "}"

    "function resolveNode(n){"
    "if(!confirm('Resolve SOS for node '+n+'?'))return;"
    "fetch('/resolve?node='+n)"
    ".then(()=>loadAll());"
    "}"

    "function clearDB(){"
    "if(!confirm('Clear all local records?'))return;"
    "fetch('/clear')"
    ".then(()=>location.reload());"
    "}"

    "function loadStatus(){"
    "fetch('/api/status')"
    ".then(r=>r.json())"
    ".then(d=>{"
    "document.getElementById('sos').innerText=d.active_sos;"
    "document.getElementById('nodes').innerText=d.nodes;"
    "document.getElementById('rx1').innerText=d.rx1_online?'ONLINE':'OFFLINE';"
    "document.getElementById('rx').innerText=d.rx;"
    "document.getElementById('tx').innerText=d.tx;"
    "document.getElementById('sosp').innerText=d.sos_packets;"
    "});"
    "}"

    "function loadNodes(){"
    "fetch('/api/nodes')"
    ".then(r=>r.json())"
    ".then(data=>{"
    "let h='<table><tr><th>Node</th><th>SOS</th><th>GPS</th><th>Hops</th><th>RSSI</th><th>Action</th></tr>';"
    "data.forEach(n=>{"
    "h+='<tr>';"
    "h+='<td><b>'+n.id+'</b></td>';"
    "h+='<td>'+(n.sos?'🔴 ACTIVE':'NORMAL')+'</td>';"
    "h+='<td>'+n.lat+', '+n.lon+'</td>';"
    "h+='<td>'+n.hop+'</td>';"
    "h+='<td>'+n.rssi+' dBm</td>';"
    "h+='<td>';"
    "h+='<button onclick=\"document.getElementById(\\'target\\').value='+n.id+'\">SELECT</button>';"
    "if(n.sos){"
    "h+='<button onclick=\"resolveNode('+n.id+')\">RESOLVE</button>';"
    "}"
    "h+='</td>';"
    "h+='</tr>';"
    "});"
    "h+='</table>';"
    "document.getElementById('nodeTable').innerHTML=h;"
    "});"
    "}"

    "function loadIncidents(){"
    "fetch('/api/incidents')"
    ".then(r=>r.json())"
    ".then(data=>{"
    "if(data.length==0){"
    "document.getElementById('incidents').innerHTML='No incidents';"
    "return;"
    "}"
    "let h='<table><tr><th>Incident</th><th>Node</th><th>Status</th><th>GPS</th><th>Hops</th><th>RSSI</th><th>Action</th></tr>';"
    "data.slice().reverse().forEach(i=>{"
    "h+='<tr>';"
    "h+='<td>'+i.id+'</td>';"
    "h+='<td>'+i.node+'</td>';"
    "h+='<td>'+i.status+'</td>';"
    "h+='<td>'+i.lat+', '+i.lon+'</td>';"
    "h+='<td>'+i.hop+'</td>';"
    "h+='<td>'+i.rssi+'</td>';"
    "h+='<td><button onclick=\"document.getElementById(\\'target\\').value='+i.node+'\">CONTROL</button></td>';"
    "h+='</tr>';"
    "});"
    "h+='</table>';"
    "document.getElementById('incidents').innerHTML=h;"
    "});"
    "}"

    "function loadMessages(){"
    "fetch('/api/messages')"
    ".then(r=>r.json())"
    ".then(data=>{"
    "if(data.length==0){"
    "document.getElementById('messages').innerHTML='No messages';"
    "return;"
    "}"
    "let h='<table><tr><th>Node</th><th>Seq</th><th>Message</th><th>Status</th></tr>';"
    "data.slice().reverse().forEach(m=>{"
    "h+='<tr>';"
    "h+='<td>'+m.node+'</td>';"
    "h+='<td>'+m.seq+'</td>';"
    "h+='<td>'+m.message+'</td>';"
    "h+='<td>'+m.status+'</td>';"
    "h+='</tr>';"
    "});"
    "h+='</table>';"
    "document.getElementById('messages').innerHTML=h;"
    "});"
    "}"

    "function loadAll(){"
    "loadStatus();"
    "loadNodes();"
    "loadIncidents();"
    "loadMessages();"
    "}"

    "loadAll();"

    "setInterval(loadAll,3000);"

    "</script>"

    "</body>"
    "</html>"
  );

  return html;
}

/* =========================================================
                    SAVE NODES
========================================================= */

void saveNodes()
{
  File file =
    LittleFS.open(
      "/nodes.db",
      "w"
    );

  if (!file)
    return;

  for (int i = 0; i < MAX_NODES; i++)
  {
    if (!nodes[i].valid)
      continue;

    file.print(
      nodes[i].nodeId
    );

    file.print("|");

    file.print(
      nodes[i].sequence
    );

    file.print("|");

    file.print(
      nodes[i].latitude
    );

    file.print("|");

    file.print(
      nodes[i].longitude
    );

    file.print("|");

    file.print(
      nodes[i].hop
    );

    file.print("|");

    file.print(
      nodes[i].rssi
    );

    file.print("|");

    file.print(
      nodes[i].sosActive
        ? 1
        : 0
    );

    file.print("|");

    file.println(
      nodes[i].resolved
        ? 1
        : 0
    );
  }

  file.close();
}

/* =========================================================
                  SAVE INCIDENTS
========================================================= */

void saveIncidents()
{
  File file =
    LittleFS.open(
      "/incidents.db",
      "w"
    );

  if (!file)
    return;

