ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
  for (int i = 0; i < MAX_INCIDENTS; i++)
  {
    if (!incidents[i].valid)
      continue;

    file.print(
      incidents[i].incidentId
    );

    file.print("|");

    file.print(
      incidents[i].nodeId
    );

    file.print("|");

    file.print(
      incidents[i].sequence
    );

    file.print("|");

    file.print(
      incidents[i].latitude
    );

    file.print("|");

    file.print(
      incidents[i].longitude
    );

    file.print("|");

    file.print(
      incidents[i].hop
    );

    file.print("|");

    file.print(
      incidents[i].rssi
    );

    file.print("|");

    file.println(
      incidents[i].status
    );
  }

  file.close();
}

/* =========================================================
                   SAVE MESSAGES
========================================================= */

void saveMessages()
{
  File file =
    LittleFS.open(
      "/messages.db",
      "w"
    );

  if (!file)
    return;

  for (int i = 0; i < MAX_MESSAGES; i++)
  {
    if (!messages[i].valid)
      continue;

    String msg =
      messages[i].message;

    msg.replace(
      "|",
      "/"
    );

    file.print(
      messages[i].nodeId
    );

    file.print("|");

    file.print(
      messages[i].sequence
    );

    file.print("|");

    file.print(
      msg
    );

    file.print("|");

    file.println(
      messages[i].status
    );
  }

  file.close();
}

/* =========================================================
                    LOAD NODES
========================================================= */

void loadNodes()
{
  if (
    !LittleFS.exists(
      "/nodes.db"
    )
  )
    return;

  File file =
    LittleFS.open(
      "/nodes.db",
      "r"
    );

  if (!file)
    return;

  int index = 0;

  while (
    file.available() &&
    index < MAX_NODES
  )
  {
    String line =
      file.readStringUntil(
        '\n'
      );

    line.trim();

    if (line.length() == 0)
      continue;

    int p[7];

    int last = -1;

    bool validLine = true;

    for (int j = 0; j < 7; j++)
    {
      p[j] =
        line.indexOf(
          '|',
          last + 1
        );

      if (p[j] < 0)
      {
        validLine = false;
        break;
      }

      last = p[j];
    }

    if (!validLine)
      continue;

    nodes[index].valid = true;

    nodes[index].nodeId =
      line.substring(
        0,
        p[0]
      ).toInt();

    nodes[index].sequence =
      strtoul(
        line.substring(
          p[0] + 1,
          p[1]
        ).c_str(),
        NULL,
        10
      );

    nodes[index].latitude =
      line.substring(
        p[1] + 1,
        p[2]
      );

    nodes[index].longitude =
      line.substring(
        p[2] + 1,
        p[3]
      );

    nodes[index].hop =
      line.substring(
        p[3] + 1,
        p[4]
      ).toInt();

    nodes[index].rssi =
      line.substring(
        p[4] + 1,
        p[5]
      ).toInt();

    nodes[index].sosActive =
      line.substring(
        p[5] + 1,
        p[6]
      ).toInt();

    nodes[index].resolved =
      line.substring(
        p[6] + 1
      ).toInt();

    nodes[index].lastSeen =
      millis();

    index++;
  }

  file.close();
}

/* =========================================================
                  LOAD INCIDENTS
========================================================= */

void loadIncidents()
{
  if (
    !LittleFS.exists(
      "/incidents.db"
    )
  )
    return;

  File file =
    LittleFS.open(
      "/incidents.db",
      "r"
    );

  if (!file)
    return;

  int index = 0;

  while (
    file.available() &&
    index < MAX_INCIDENTS
  )
  {
    String line =
      file.readStringUntil(
        '\n'
      );

    line.trim();

    if (line.length() == 0)
      continue;

    String fields[8];

    int start = 0;

    bool ok = true;

    for (int f = 0; f < 7; f++)
    {
      int pos =
        line.indexOf(
          '|',
          start
        );

      if (pos < 0)
      {
        ok = false;
        break;
      }

      fields[f] =
        line.substring(
          start,
          pos
        );

      start = pos + 1;
    }

    if (!ok)
      continue;

    fields[7] =
      line.substring(
        start
      );

    incidents[index].valid = true;

    incidents[index].incidentId =
      fields[0];

    incidents[index].nodeId =
      fields[1].toInt();

    incidents[index].sequence =
      strtoul(
        fields[2].c_str(),
        NULL,
        10
      );

    incidents[index].latitude =
      fields[3];

    incidents[index].longitude =
      fields[4];

    incidents[index].hop =
      fields[5].toInt();

    incidents[index].rssi =
      fields[6].toInt();

    incidents[index].status =
      fields[7];

    incidents[index].createdAt =
      millis();

    incidents[index].updatedAt =
      millis();

    index++;
  }

  file.close();
}

/* =========================================================
                  LOAD MESSAGES
========================================================= */

void loadMessages()
{
  if (
    !LittleFS.exists(
      "/messages.db"
    )
  )
    return;

  File file =
    LittleFS.open(
      "/messages.db",
      "r"
    );

  if (!file)
    return;

  int index = 0;

  while (
    file.available() &&
    index < MAX_MESSAGES
  )
  {
    String line =
      file.readStringUntil(
        '\n'
      );

    line.trim();

    if (line.length() == 0)
      continue;

    int p1 =
      line.indexOf('|');

    int p2 =
      line.indexOf(
        '|',
        p1 + 1
      );

    int p3 =
      line.indexOf(
        '|',
        p2 + 1
      );

    if (
      p1 < 0 ||
      p2 < 0 ||
      p3 < 0
    )
    {
      continue;
    }

    messages[index].valid =
      true;

    messages[index].nodeId =
      line.substring(
        0,
        p1
      ).toInt();

    messages[index].sequence =
      strtoul(
        line.substring(
          p1 + 1,
          p2
        ).c_str(),
        NULL,
        10
      );

    messages[index].message =
      line.substring(
        p2 + 1,
        p3
      );

    messages[index].status =
      line.substring(
        p3 + 1
      );

    messages[index].timestamp =
      millis();

    index++;
  }

  file.close();
}

/* =========================================================
                         SETUP
========================================================= */

void setup()
{
  Serial.begin(115200);

