ecegcebodi-droid/Project_expo_2k26/TerraLink/Firmware/V3_Receiver_node/src/ESP8266_Rx2.cpp
  delay(500);

  Serial.println();
  Serial.println(
    "============================================"
  );
  Serial.println(
    "       TERRALINK RECEIVER #2"
  );
  Serial.println(
    "        RESCUE COMMAND CENTER"
  );
  Serial.println(
    "============================================"
  );

  /* -------------------------------------------------------
                           UART
  ------------------------------------------------------- */

  rescueSerial.begin(
    UART_BAUD
  );

  Serial.println(
    "[OK] UART RX2 initialized"
  );

  /* -------------------------------------------------------
                          KEYPAD
  ------------------------------------------------------- */

  for (int r = 0; r < 4; r++)
  {
    pinMode(
      rowPins[r],
      OUTPUT
    );

    digitalWrite(
      rowPins[r],
      HIGH
    );
  }

  for (int c = 0; c < 4; c++)
  {
    pinMode(
      colPins[c],
      INPUT_PULLUP
    );
  }

  Serial.println(
    "[OK] Keypad initialized"
  );

  /* -------------------------------------------------------
                         DATABASE
  ------------------------------------------------------- */

  initDatabase();

  if (
    LittleFS.begin()
  )
  {
    Serial.println(
      "[OK] LittleFS mounted"
    );

    loadNodes();
    loadIncidents();
    loadMessages();

    Serial.print(
      "[DB] Nodes: "
    );

    Serial.println(
      getNodeCount()
    );
  }
  else
  {
    Serial.println(
      "[ERROR] LittleFS failed"
    );
  }

  /* -------------------------------------------------------
                        WIFI AP
  ------------------------------------------------------- */

  WiFi.mode(
    WIFI_AP
  );

  if (
    WiFi.softAP(
      AP_SSID,
      AP_PASSWORD
    )
  )
  {
    Serial.println(
      "[OK] WiFi AP started"
    );

    Serial.print(
      "SSID: "
    );

    Serial.println(
      AP_SSID
    );

    Serial.print(
      "IP: "
    );

    Serial.println(
      WiFi.softAPIP()
    );
  }

  /* -------------------------------------------------------
                       WEB SERVER
  ------------------------------------------------------- */

  setupWebServer();

  server.begin();

  Serial.println(
    "[OK] Web server started"
  );

  Serial.println();
  Serial.println(
    "============================================"
  );
  Serial.println(
    "       RESCUE COMMAND CENTER READY"
  );
  Serial.println(
    "============================================"
  );

  showHomeScreen();
}

/* =========================================================
                          LOOP
========================================================= */

void loop()
{
  processUART();

  char key =
    getKeypadKey();

  if (key != 0)
  {
    handleKey(key);
  }

  server.handleClient();

  /*
     RX1 timeout indication.
  */

  if (
    rx1Online &&
    millis() - rx1LastSeen > 10000
  )
  {
    rx1Online = false;
  }

  yield();
}